In [3]:
import pandas as pd

In [6]:
naren = pd.DataFrame({'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'] , 'Age':[23, 25, 22, 24, 23] ,'Gender':['F', 'M', 'M', 'M', 'F'], 'Score':[85, 78, 92, 70, 88]})

In [44]:
naren = naren.drop(0,axis = 1)

In [68]:
naren =naren._append({'Name':'Alice','Age':23,'Gender':'F','Score':85},ignore_index = True)

In [72]:
naren1 = naren.loc[1]
naren.loc[1]=naren.loc[4]
naren.loc[4] = naren1

In [8]:
naren

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [10]:
noren = naren.loc[0:2]
noren

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92

In [12]:
noren = naren[naren['Gender']=='F']
noren

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [14]:
naren['Score1'],naren['Score2'] = naren['Score'],naren['Score']
naren

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [16]:
naren['Age1'] = naren['Age']
naren

      Name  Age Gender  Score  Score1  Score2  Age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [18]:
naren = naren.drop(['Age'],axis = 1)
naren

      Name Gender  Score  Score1  Score2  Age1
0    Alice      F     85      85      85    23
1      Bob      M     78      78      78    25
2  Charlie      M     92      92      92    22
3    David      M     70      70      70    24
4      Eva      F     88      88      88    23

In [20]:
naren = naren.drop(['Score1','Score2'],axis=1)
naren

      Name Gender  Score  Age1
0    Alice      F     85    23
1      Bob      M     78    25
2  Charlie      M     92    22
3    David      M     70    24
4      Eva      F     88    23

In [22]:
naren=naren.drop(3,axis=0)
naren

      Name Gender  Score  Age1
0    Alice      F     85    23
1      Bob      M     78    25
2  Charlie      M     92    22
4      Eva      F     88    23

In [36]:
noren = naren[(naren['Gender']=='F') & (naren['Score']>=85)]
noren

    Name Gender  Score  Age1
0  Alice      F     85    23
4    Eva      F     88    23

In [55]:
noren = naren.sort_values(by = 'Score',ascending = False)
noren

      Name Gender  Score  Age1
2  Charlie      M     92    22
4      Eva      F     88    23
0    Alice      F     85    23
1      Bob      M     78    25

In [59]:
def loop(score):
    if score > 85:
        return 'A'
    elif score > 60:
        return 'B'
    elif score > 40:
        return 'C'
    else:
        return 'D'

In [63]:
naren['Grade'] = naren['Score'].apply(loop)
naren

      Name Gender  Score  Age1 Grade
0    Alice      F     85    23     B
1      Bob      M     78    25     B
2  Charlie      M     92    22     A
4      Eva      F     88    23     A

In [5]:
data=pd.DataFrame(
    {'Month': ['Jan', 'Feb', 'Mar', 'Jan', 'Feb', 'Mar'],
    'Product': ['A', 'A', 'A', 'B', 'B', 'B'],
    'Sales': [150, 200, 250, 300, 400, 500]}
)

In [7]:
data

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [9]:
data.groupby('Product').sum('Sales')

         Sales
Product
A          600
B         1200

In [13]:
data.loc[data.groupby('Product')['Sales'].idxmax()]

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [15]:
x=data.groupby('Product')['Sales'].transform('sum')
data['Percentage']=(data['Sales']/x)*100
data

  Month Product  Sales  Percentage
0   Jan       A    150   25.000000
1   Feb       A    200   33.333333
2   Mar       A    250   41.666667
3   Jan       B    300   25.000000
4   Feb       B    400   33.333333
5   Mar       B    500   41.666667

In [17]:
employee=pd.DataFrame(
    {'Name': ['John', 'Doe', 'Jane', 'Anna', 'Smith'],
    'Department': ['HR', 'Finance', None, 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, None, 58000]}
)
employee

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [19]:
employee.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [25]:
mode=employee['Department'].mode()[0]
mode

'HR'

In [27]:
employee['Department']=employee['Department'].fillna(value=mode)
employee

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [29]:
mean=employee['Salary'].mean()
employee['Salary']=employee['Salary'].fillna(value=mean)
employee

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [31]:
employee.isnull().sum()

Name          0
Department    0
Salary        0
dtype: int64

In [33]:
employee=employee.dropna()
employee

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [35]:
temp = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temp

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [37]:
mean1=temp.mean()
median = temp.median()
std = temp.std()

In [39]:
mean1

24.6

In [41]:
median

24.5

In [43]:
std

3.204163957519444

In [45]:
temperature = (temp-32)*5/9
temperature

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [47]:
temp.idxmax()

5

In [49]:
temp.idxmin()

2

In [51]:
temp.sort_values(ascending=True)

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [53]:
temp.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [55]:
data1 = pd.DataFrame({'OrderID': [1, 2, 3, 4, 5],
'CustomerID': [101, 102, 103, 104, 101],
'Product': ['A', 'B', 'A', 'C', 'B']
})

In [57]:
data1

   OrderID  CustomerID Product
0        1         101       A
1        2         102       B
2        3         103       A
3        4         104       C
4        5         101       B

In [59]:
customers_data = pd.DataFrame(
    {'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
)

In [61]:
customers_data

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [69]:
orders = pd.DataFrame({'OrderID': [1, 2, 3, 4, 5],
'CustomerID': [101, 102, 103, 104, 101],
'Product': ['A', 'B', 'A', 'C', 'B']
})

In [71]:
merged = pd.merge(orders,customers_data,on="CustomerID")

In [73]:
merged

   OrderID  CustomerID Product     Name     Location
0        1         101       A    Alice     New York
1        2         102       B      Bob  Los Angeles
2        3         103       A  Charlie      Chicago
3        4         104       C    David      Houston
4        5         101       B    Alice     New York

In [77]:
grouped = merged.groupby('Location')['Name'].size().reset_index(name='Total Orders')
grouped

      Location  Total Orders
0      Chicago             1
1      Houston             1
2  Los Angeles             1
3     New York             2